#!/usr/bin/env python3
#Создайте программу, которая будет принимать число (n), введенное пользователем, и выдавать результат в виде (n+nn).

number = int(input("insert some number:"))
number_out =number + number*number;
print (number_out)
