#!/usr/bin/env python3

list_ex = ['tt', 'nn']

for i, val in enumerate(list_ex) :
    print ("i =", i, "val =", val)

#Выведите каждый 3 элемент списка начиная с первого и заканчивая предпоследним.
list = [3.4, 56, "Some", "Hi", 7, 3.8, 44]
print (list[:-1:3])
print (list[-3])

