#!/usr/bin/env python3
#Создайте переменную со значением 46 и переменную со значением "string". Последнюю переменную умножьте на 5.

num = 46
var_st = 'string'
var_st *= 5;
print ("num = ",num,"rub")
print("num =  %d rub" % (num))
print ("var_st = ", var_st, "rub")
