#!/usr/bin/env python3

#Импортируйте в ваш проект из модуля math только значение pi и функцию ceil. Для функции ceil сделайте псевдоним "c"

#Создайте свой модуль и добавьте в него одну функцию и две переменных. Импортируйте функцию, а также только одну переменную.

#При помощи модуля random создайте случайное число. За это отвечает метод randint, который принимает два параметра в качестве промежутка чисел.В цикле просите пользователя ввести число, если оно не совпадает со случайным числом, то вы должны давать пользователю подсказки. Если число является большим, то вы должны написать что "Число что вы пытаетесь угадать больше" или же наоборот.

#Импортируйте модуль datetime. Он отвечает за работу с датой и временем. Выведите на экран полную дату. За это отвечает datetime и его метод now.Из модуля импортируйте только саму функцию datetime при этом добавьте к ней псевдоним, чтобы было проще с ней работать.
